In [ ]:
import pandas as pd
import sqlite3

In [16]:
# Conectamos con la base de datos chinook.db
connection = sqlite3.connect("data/my_database.db")

# Obtenemos un cursor que utilizaremos para hacer las queries
crsr = connection.cursor()

In [17]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

cervezas

In [18]:
# Con esta función leemos los datos y lo pasamos a un DataFrame de Pandas
def sql_query(query):

    # Ejecuta la query
    crsr.execute(query)

    # Almacena los datos de la query 
    ans = crsr.fetchall()

    # Obtenemos los nombres de las columnas de la tabla
    names = [description[0] for description in crsr.description]

    return pd.DataFrame(ans,columns=names)

In [24]:
query = '''
CREATE TABLE cervezas (
    CodC VARCHAR(2),
    Envase VARCHAR(32),
    Capacidad FLOAT(2),
    Stock INT(5),
    PRIMARY KEY (CodC)
)
'''

crsr.execute(query)

In [20]:
res = crsr.execute("SELECT name FROM sqlite_master WHERE type='table'")
for name in res:
    print(name[0])

cervezas

In [21]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   01  Botella       0.20   3600
1   02  Botella       0.25   5000
2   03     Lata       0.33   2400
3   04  Botella       1.00    288

In [22]:
query = '''
DROP TABLE cervezas 
'''
crsr.execute(query)

In [23]:
query = '''
INSERT INTO Cervezas (CodC, Envase, Capacidad, Stock)
VALUES ('01','Botella',0.2,3600)
'''
crsr.execute(query)

OperationalError: no such table: Cervezas

In [25]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

Empty DataFrame
Columns: [CodC, Envase, Capacidad, Stock]
Index: []

In [26]:
query = '''
INSERT INTO Cervezas VALUES ('02','Botella',0.33,1200)
'''
crsr.execute(query)

In [27]:
query = '''
INSERT INTO Cervezas VALUES ('03','Lata',0.33,2400),
('04','Botella',1,288),
('05','Barril',60,30)
'''
crsr.execute(query)

In [28]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   02  Botella       0.33   1200
1   03     Lata       0.33   2400
2   04  Botella       1.00    288
3   05   Barril      60.00     30

## DataFame a BD sql

[pandas.DataFrame.to_sql](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.to_sql.html)

In [29]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   02  Botella       0.33   1200
1   03     Lata       0.33   2400
2   04  Botella       1.00    288
3   05   Barril      60.00     30

In [30]:
query = '''
UPDATE cervezas
SET Stock = 5000, Capacidad = 0.25
WHERE CodC='02';
'''
crsr.execute(query)

In [31]:
query = '''
SELECT * FROM cervezas 
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   02  Botella       0.25   5000
1   03     Lata       0.33   2400
2   04  Botella       1.00    288
3   05   Barril      60.00     30

In [32]:
query = '''
DELETE FROM cervezas WHERE CodC='05';
'''
crsr.execute(query)

In [33]:
query = '''
SELECT * FROM cervezas
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   02  Botella       0.25   5000
1   03     Lata       0.33   2400
2   04  Botella       1.00    288

## SUBQUERIES

In [37]:
query = '''
SELECT * FROM (SELECT * FROM Cervezas WHERE Envase="Botella") WHERE stock = 288
'''
sql_query(query)

  CodC   Envase  Capacidad  Stock
0   04  Botella        1.0    288

In [ ]:
# ATENCIÓN! Al terminar hay que cerrar la conexión a la DB para que se guarden los cambios!!!!!!
connection.commit()
connection.close()